run/BristleWing/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     4.0                                |
|   \  /    A nd           | Web:         http://www.foam-extend.org         |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
vertices
(
	(0 0 0)      //0
	(823.2233 0 0)      //1
	(1176.7767 0 0)      //2
	(2000 0 0)      //3
	(0 823.2233 0)      //4
	(823.2233 823.2233 0)      //5
	(1176.7767 823.2233 0)      //6
	(2000 823.2233 0)      //7
	(0 1176.7767 0)      //8
	(823.2233 1176.7767 0)      //9
	(1176.7767 1176.7767 0)      //10
	(2000 1176.7767 0)      //11
	(0 2000 0)      //12
	(823.2233 2000 0)      //13
	(1176.7767 2000 0)      //14
	(2000 2000 0)      //15

	(0 0 1500)      //16
	(823.2233 0 1500)      //17
	(1176.7767 0 1500)      //18
	(2000 0 1500)      //19
	(0 823.2233 1500)      //20
	(823.2233 823.2233 1500)      //21
	(1176.7767 823.2233 1500)      //22
	(2000 823.2233 1500)      //23
	(0 1176.7767 1500)      //24
	(823.2233 1176.7767 1500)      //25
	(1176.7767 1176.7767 1500)      //26
	(2000 1176.7767 1500)      //27
	(0 2000 1500)      //28
	(823.2233 2000 1500)      //29
	(1176.7767 2000 1500)      //30
	(2000 2000 1500)      //31
	(911.6117 911.6117 1500)      //32
	(1088.3883 911.6117 1500)      //33
	(1088.3883 1088.3883 1500)      //34
	(911.6117 1088.3883 1500)      //35

	(0 0 2000)      //36
	(823.2233 0 2000)      //37
	(1176.7767 0 2000)      //38
	(2000 0 2000)      //39
	(0 823.2233 2000)      //40
	(823.2233 823.2233 2000)      //41
	(1176.7767 823.2233 2000)      //42
	(2000 823.2233 2000)      //43
	(0 1176.7767 2000)      //44
	(823.2233 1176.7767 2000)      //45
	(1176.7767 1176.7767 2000)      //46
	(2000 1176.7767 2000)      //47
	(0 2000 2000)      //48
	(823.2233 2000 2000)      //49
	(1176.7767 2000 2000)      //50
	(2000 2000 2000)      //51
	(911.6117 911.6117 2000)      //52
	(1088.3883 911.6117 2000)      //53
	(1088.3883 1088.3883 2000)      //54
	(911.6117 1088.3883 2000)      //55

);

blocks
(
	hex (0 1 5 4 16 17 21 20) (5 5 10) simpleGrading (1 1 1)
	hex (1 2 6 5 17 18 22 21) (5 5 10) simpleGrading (1 1 1)
	hex (2 3 7 6 18 19 23 22) (5 5 10) simpleGrading (1 1 1)
	hex (4 5 9 8 20 21 25 24) (5 5 10) simpleGrading (1 1 1)
	hex (6 7 11 10 22 23 27 26) (5 5 10) simpleGrading (1 1 1)
	hex (8 9 13 12 24 25 29 28) (5 5 10) simpleGrading (1 1 1)
	hex (9 10 14 13 25 26 30 29) (5 5 10) simpleGrading (1 1 1)
	hex (10 11 15 14 26 27 31 30) (5 5 10) simpleGrading (1 1 1)
	hex (16 17 21 20 36 37 41 40) (5 5 4) simpleGrading (1 1 1)
	hex (17 18 22 21 37 38 42 41) (5 5 4) simpleGrading (1 1 1)
	hex (18 19 23 22 38 39 43 42) (5 5 4) simpleGrading (1 1 1)
	hex (20 21 25 24 40 41 45 44) (5 5 4) simpleGrading (1 1 1)
	hex (22 23 27 26 42 43 47 46) (5 5 4) simpleGrading (1 1 1)
	hex (24 25 29 28 44 45 49 48) (5 5 4) simpleGrading (1 1 1)
	hex (25 26 30 29 45 46 50 49) (5 5 4) simpleGrading (1 1 1)
	hex (26 27 31 30 46 47 51 50) (5 5 4) simpleGrading (1 1 1)
	hex (21 32 35 25 41 52 55 45) (5 5 4) simpleGrading (1 1 1)
	hex (21 22 33 32 41 42 53 52) (5 5 4) simpleGrading (1 1 1)
	hex (33 22 26 34 53 42 46 54) (5 5 4) simpleGrading (1 1 1)
	hex (35 34 26 25 55 54 46 45) (5 5 4) simpleGrading (1 1 1)
	hex (32 33 34 35 52 53 54 55) (5 5 4) simpleGrading (1 1 1)

);

edges
(
	arc 5 6 (1000.0 750.0 0)
	arc 6 10 (1250.0 1000.0 0)
	arc 10 9 (1000.0 1250.0 0)
	arc 9 5 (750.0 1000.0 0)
	arc 21 22 (1000.0 750.0 1500)
	arc 22 26 (1250.0 1000.0 1500)
	arc 26 25 (1000.0 1250.0 1500)
	arc 25 21 (750.0 1000.0 1500)
	arc 41 42 (1000.0 750.0 2000.0)
	arc 42 46 (1250.0 1000.0 2000.0)
	arc 46 45 (1000.0 1250.0 2000.0)
	arc 45 41 (750.0 1000.0 2000.0)
);

patches
(
	patch bottom
	(
		(0 1 5 4)
		(1 2 6 5)
		(2 3 7 6)
		(4 5 9 8)
		(6 7 11 10)
		(8 9 13 12)
		(9 10 14 13)
		(10 11 15 14)
	)

	patch top
	(
		(36 37 41 40)
		(37 38 42 41)
		(38 39 43 42)
		(40 41 45 44)
		(42 43 47 46)
		(44 45 49 48)
		(45 46 50 49)
		(46 47 51 50)
		(41 52 55 45)
		(41 42 53 52)
		(53 42 46 54)
		(55 54 46 45)
		(52 53 54 55)
	)

	patch inlet
	(
		(0 4 20 16)
		(4 8 24 20)
		(8 12 28 24)
		(16 20 40 36)
		(20 24 44 40)
		(24 28 48 44)
	)

	patch outlet
	(
		(3 7 23 19)
		(7 11 27 23)
		(11 15 31 27)
		(19 23 43 39)
		(23 27 47 43)
		(27 31 51 47)
	)

	patch bristle
	(
		(32 33 34 35)
		(21 32 35 25)
		(21 22 33 32)
		(33 22 26 34)
		(35 34 26 25)
		(5 6 22 21)
		(6 10 26 22)
		(10 9 25 26)
		(9 5 21 25)
	)

	patch frontAndBackPlanes
	(
		(0 1 17 16)
		(1 2 18 17)
		(2 3 19 18)
		(16 17 37 36)
		(17 18 38 37)
		(18 19 39 38)
		(12 13 29 28)
		(13 14 30 29)
		(14 15 31 30)
		(28 29 49 48)
		(29 30 50 49)
		(30 31 51 50)
	)
);

mergePatchPairs
(
);


// ************************************************************************* //

